T-recks/nRF5x-custom-ble-service-tutorial/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    //init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

//Sensor stuff
// a function to initialize the twi(i2c)
void twi_init(void)
{
  ret_code_t err_code; // a variable to hold error code

// Create a struct with configurations and pass the values to these configurations.
  const nrf_drv_twi_config_t twi_config = {
    .scl                = 27, // scl connected to pin 22, you can change it to any other pin
    .sda                = 26, // sda connected to pin 23, you can change it to any other pin
    .frequency          = NRF_DRV_TWI_FREQ_100K, // set the communication speed to 100K, we can select 250k or 400k as well
    .interrupt_priority = APP_IRQ_PRIORITY_HIGH, // Interrupt priority is set to high, keep in mind to change it if you are using a soft-device
    .clear_bus_init     = false // automatic bus clearing

  };

  err_code = nrf_drv_twi_init(&m_twi, &twi_config, NULL, NULL); // initialize the twi
  APP_ERROR_CHECK(err_code); // check if any error occured during initialization

  nrf_drv_twi_enable(&m_twi); // enable the twi comm so that its ready to communicate with the sensor

}
ret_code_t write(uint16_t command) {
  uint8_t cmd[2];
  cmd[0] = command >> 8;
  cmd[1] = command & 0xFF;
  return nrf_drv_twi_tx(&m_twi, ADDR, cmd, sizeof(cmd), true);
}

static uint8_t crc8(const uint8_t *data, int len) {
  const uint8_t poly = 0x31;
  uint8_t crc = 0xFF;
  for(int j = len; j; --j) {
    crc ^= *data++;
    for(int i = 8; i; --i){
        crc = (crc & 0x80) ? (crc << 1) ^ poly : (crc << 1);
    }
  }
  return crc;
}

void reset(void){
    write(SHT31_SOFTRESET);
    nrf_delay_ms(10);
}

float temp_in_c(float data) {
   data = data / (65535.0f);
   return data*175 - 45;
}
float hum_in_rh(float data) {
   data = data / (65535.0f);
   return 100*data;
}

bool readData(void) {
    uint8_t readbuffer[6];
    write(SHT31_MEAS_HIGHREP); //tell the sensor we want to read
    nrf_delay_ms(20); //give some time for the sensor to react
    nrf_drv_twi_rx(&m_twi, ADDR, &readbuffer, sizeof(readbuffer)); //read
    if (readbuffer[2] != crc8(readbuffer, 2) || readbuffer[5] != crc8(readbuffer + 3, 2))
        return false;
    int32_t tmp = (int32_t)(((uint32_t) readbuffer[0] << 8 | readbuffer[1]));
    tmp = (float) tmp;
    temp = temp_in_c(tmp);
    uint32_t hm = ((uint32_t) readbuffer[3] << 8 | readbuffer[4]);
    hm = (float) hm;
    hum = hum_in_rh(hm);
    return true;
}

uint16_t readStatus(void) {
    write(SHT31_READSTATUS);
    uint8_t data[3];
    nrf_drv_twi_rx(&m_twi, ADDR, &data, sizeof(data)); //read
    uint16_t stat = data[0];
    stat <<= 8;
    stat |= data[1];
    return stat;
}


bool begin(void) {
    reset();
    return readStatus() != 0xFFFF;
}

void sensor_poll(){
      readData();
      NRF_LOG_INFO("Temp:" NRF_LOG_FLOAT_MARKER " Hum: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(temp), NRF_LOG_FLOAT(hum));
}

static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}

 
static void repeated_timer_handler(void * p_context)
{
    readData();
    stk_ptr = stk_ptr >= ARR_SIZE? stk_ptr : stk_ptr + 1;
    temp_array[stk_ptr] = temp;
    hum_array[stk_ptr] = hum;
    NRF_LOG_INFO("Temp:" NRF_LOG_FLOAT_MARKER " Hum: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(temp), NRF_LOG_FLOAT(hum));
}

static void create_timers()
{
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    ret_code_t err_code;
    // Initialize.
    lfclk_request();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    app_timer_init();
    create_timers();
    // Start execution.
    //NRF_LOG_DEFAULT_BACKENDS_INIT();
    NRF_LOG_FLUSH();
    NRF_LOG_INFO("Template example started.");
    NRF_LOG_FLUSH();
    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    //virtual_timer_init();
    twi_init();
    bool b = begin();
    if(b) {
      NRF_LOG_INFO("Successfully turned on sensor")
    }  else {
      NRF_LOG_INFO("Sensor didn't turn on :(");
    }
    NRF_LOG_FLUSH();
    

    advertising_start(erase_bonds);
    err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(1000), NULL);
    APP_ERROR_CHECK(err_code);
    //virtual_timer_start_repeated(1000, sensor_poll);
    // Enter main loop.
    for (;;)
    {

        idle_state_handle();
        
    }
}


/**
 * @}
 */
